#Калькулятор депозиту

print("\tВас вітає калькулятор депозиту!")
знайомство = input("Чи хочете дізнатися, як працює калькулятор депозиту? (так/ні): ")
if знайомство.lower() == "так":
    print("Калькулятор депозиту допоможе Вам розрахувати, скільки грошей Ви заробите на своєму депозиті.\nВам потрібно ввести:\n\t1) Суму Вашого депозиту.\n\t2) Річну ставку, котру надає Ваш банк.\n\t3) Та термін дії депозиту.")
    print("Наприклад, Ви вносите 1000 грн на 12 місяців під 15% річних, тобто кожного місяця до 1000 грн буде додаватися 15%/12міс = 1.25%.\nТобто уже через місяць у Вас на рахунку буде 1012.5 грн.\nА в наступному місяці річний відсоток береться від суми 1012.5 грн. Тобто будемо мати 1025.16 грн. І так далі.")
    print("Сподіваюсь принцип зрозумілий. Чекаю на Ваші дані.🫡")
    
else:
    print("Тоді почнемо рахувати Ваші гроші🤑")

while True:
    try:
        сума_депозиту = float(input("Введіть суму депозиту: "))
        річні_відсотки = float(input("Введіть річні відсотки: "))
        тривалість_депозиту = int(input("Введіть тривалість депозиту у місяцях: "))
        
        if сума_депозиту <= 0 or річні_відсотки < 0 or тривалість_депозиту <= 0:
            raise ValueError("Усі значення повинні бути більше за 0. Будь ласка, введіть коректні дані")

        break
    except ValueError as e:
        print(f"Помилка: {e}")
        continue
    

поточна_сума = сума_депозиту

for місяць in range(1, тривалість_депозиту + 1):
    місячні_відсотки = (річні_відсотки / 12) / 100 #ділимо на 100 для переведення відсотків в формат десяткових чисел
    нараховані_відсотки = поточна_сума * місячні_відсотки
    поточна_сума += нараховані_відсотки
    print(f"Місяць {місяць}: Поточна сума = {поточна_сума:.2f}, Нараховано = {нараховані_відсотки:.2f}")
    









