#Завдання 1
print("Лабораторна робота №1")
print("Чилік Артур, КІ-1")

#Завдання 2

# Оголошення змінних
a = 451
b = 223
c = 4
d = 3

# Обчислення виразу
x = (a + b) / c ** d

# Виведення результату
print("Результат обчислення:", x)

#Спосіб №2

# Зчитування значень змінних від користувача
a = int(input("Введіть значення для a: "))
b = float(input("Введіть значення для b: "))
c = float(input("Введіть значення для c: "))
d = float(input("Введіть значення для d: "))

# Обчислення виразу
result = (a + b) / c ** d

# Виведення результату
print("Результат обчислення:", result)
